app/views/smbs/index.html.erb

    <td><%= smb.abbr_name %></td>
    <td><%= BusinessCatagory.find(smb.business_catagory_id).business %></td>
---
SELECT "business_catagories".* FROM "business_catagories" WHERE "business_catagories"."id" = ? LIMIT 1  [["id", 272]]

    <% if !smb.state_id.nil? %>
    	<td><%= State.find(smb.state_id).name %></td>
---
SELECT "states".* FROM "states" WHERE "states"."id" = ? LIMIT 1  [["id", 69]]

    <td><%= smb.zip_pos %></td>
    <td><%= Country.find(smb.country_id).name %></td>
---
SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT 1  [["id", 1039]]