app/views/smbs/show.html.erb

SELECT "business_catagories".* FROM "business_catagories" WHERE "business_catagories"."id" = ? LIMIT 1  [["id", 1]]
---
  <b>Catagory:</b>
  <%= BusinessCatagory.find(@smb.business_catagory_id).business %>

SELECT "states".* FROM "states" WHERE "states"."id" = ? LIMIT 1  [["id", 109]]
---
  <% if !@smb.state_id.nil? %>
  	<%= State.find(@smb.state_id).name.to_s + ', '%>

SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT 1  [["id", 1001]]
---
  <% end %>
  <%= Country.find(@smb.country_id).name.to_s %><br />