app/controllers/custsessions_controller.rb

  def create
    session[:auth] = request.env["omniauth.auth"] #store some facebook info to a sessiony
    redirect_to "/#{Smb.find(session[:temp_smb_id]).username}" #, :notice => "Signed in!" #TODO maybe do not need notice
---
SELECT "smbs".* FROM "smbs" WHERE "smbs"."id" = ? LIMIT 1  [["id", 1]]

  def destroy
    session[:auth] = nil
    redirect_to "/#{Smb.find(session[:temp_smb_id]).username}"#, :notice => "Signed out!"
---
SELECT "smbs".* FROM "smbs" WHERE "smbs"."id" = ? LIMIT 1  [["id", 1]]