app/controllers/customers_controller.rb

  def find_conjunction(list_1, list_2, list_3=nil)
    list = []
    list_1.each do |elem_1|
      list_2.each do |elem_2|
        if list_3 != nil
          list_3.each do |elem_3|
            if ((elem_1 == elem_2) and (elem_2 == elem_3))
              list.push(elem_1.id)
            end
          end
        else
          if (elem_1 == elem_2)
            list.push(elem_1.id)
          end
        end
      end
    end
    t = Code.where(:id => list)
---
SELECT "codes".* FROM "codes" WHERE "codes"."customer_id" = 25

  def create
    if active_campaign = @selector.campaigns.find_by_status(true)
      @active_campaign = active_campaign

      @email_of_customer = Customer.where(:email => params[:customer][:email])
      if @email_of_customer.empty?
        #@customer = Customer.new(params[:customer])
        @customer = Customer.new()
        #@customer.username = params[:customer][:username]
        @customer.fullname = params[:customer][:fullname]
        #@customer.phone = params[:customer][:phone]
        @customer.email = params[:customer][:email]
        #@customer.photo = params[:customer][:photo] # to be edited
        @customer.frien_welc = params[:customer][:frien_welc]
        @customer.auth_token = params[:customer][:auth_token]
        # Generate partial codes.
        @customer.partial_code = SecureRandom.base64(5).delete("=").delete("\n\r").tr("+/", "-_")
      else
        # Just update attributes (need discussion) without saving for now
        @customer = @email_of_customer.first
        @customer.fullname = params[:customer][:fullname]
        @customer.frien_welc = params[:customer][:frien_welc]
        #@customer.phone = params[:customer][:phone]
      end
      # tested
      if !session[:auth] # if not logged in to facebook, do the normal things
        @email_of_friend = Friend.where(:email => params[:customer][:friends_attributes]['0'][:email])
        if @email_of_friend.empty?
---
SELECT "customers".* FROM "customers" WHERE "customers"."email" = 'lixuefeifrank@126.com' LIMIT 1
SELECT COUNT(*) FROM "customers" WHERE "customers"."email" = 'dsadfads@fffff.dddddddddddd'
SELECT COUNT(*) FROM "friends" WHERE "friends"."email" = 'ewerwerw@examplefriend.com'

        # @friend.save!
        # @customer.save!
        respond_to do |format|
          if (@customer.save and @friend.save)
---
INSERT INTO "customers" ("auth_token", "created_at", "email", "frien_welc", "fullname", "partial_code", "password", "phone", "photo", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "friends" ("created_at", "email", "facebook", "fullname", "partial_code", "phone", "twitter", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "customers" SET "updated_at" = '2012-03-02 22:55:50.770727', "partial_code" = 'HdJsh7o' WHERE "customers"."id" = 30

              #if code = Code.find_by_smb_partial_and_cust_partial_and_frien_partial(@selector.partial_code, @customer.partial_code, @friend.partial_code) #1
                if code.cust_init_status == "SENT"
                  #update the status attribute to SENT_AGAIN
                  code.update_attributes(:cust_init_status => "SENT_AGAIN")
---
UPDATE "codes" SET "pointer_id" = 1, "updated_at" = '2012-03-02 22:57:08.583343' WHERE "codes"."id" = 49

                new_code.cust_success_code = new_code.smb_partial+new_code.cust_partial+random_partial
                new_code.frien_code = new_code.smb_partial+new_code.cust_partial+new_code.frien_partial
                new_code.cust_init_code = new_code.smb_partial+new_code.cust_partial
                new_code.save(:validate => false)
---
INSERT INTO "codes" ("campaign_id", "created_at", "cust_init_code", "cust_init_status", "cust_partial", "cust_success_code", "cust_success_status", "customer_id", "frien_code", "frien_partial", "frien_status", "friend_id", "incentive_id", "paid", "pointer_id", "smb_id", "smb_partial", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

                @active_campaign.codes.push(new_code)
                # push new code to incentives, to be tested.
                if params[:customer][:codes_attributes]['0'][:incentive_id].present?
                  @selected_incentive = @active_campaign.incentives.find(params[:customer][:codes_attributes]['0'][:incentive_id])
---
SELECT "incentives".* FROM "incentives" WHERE "incentives"."campaign_id" = 2 AND "incentives"."id" = ? LIMIT 1  [["id", "69"]]

                #end
              end

              if @selector.friends.where(:id => @friend.id).empty? #push friend to smb
---
SELECT COUNT(*) FROM "friends" INNER JOIN "assignments" ON "friends"."id" = "assignments"."friend_id" WHERE "assignments"."customer_id" = 28 AND "friends"."id" = 34