app/controllers/sessions_controller.rb

SELECT "smbs".* FROM "smbs" WHERE (email = 'testuser' or username = 'testuser') LIMIT 1
SELECT "smbs".* FROM "smbs" WHERE "smbs"."id" = ? LIMIT 1  [["id", 7]]
---
  def create
    user = Smb.authenticate(params[:email], params[:password])
    if user
      if params[:remember_me]
        cookies.permanent[:smb_auth_token] = user.auth_token
      else
        cookies[:smb_auth_token] = user.auth_token
      end
      flash[:notice] = "Logged in!"
      respond_to do |format|
        if user.first_time
          if user.activated
            if user.profile_completed
              if user.campaign_created
                if user.campaign_confirmed
                  if user.campaign_launched
                    format.html {redirect_to dashboard_smb_path(user)}
                    format.json {render json: ActiveSupport::JSON.encode({:url => dashboard_smb_path(user) })}
                  else
                    campaign = user.campaigns.find(:last, :conditions => ['temp = ?', false])