app/controllers/smbs_controller.rb

SELECT "smbs".* FROM "smbs"
---
  def index
    if admin?
      if (params[:customer_id].present? or params[:friend_id].present?)
        @smbs = @selector.smbs
        respond_to do |format|
          format.html # index.html.erb
          format.json { render :json => @smbs }
        end
      else
        @smbs = Smb.all

INSERT INTO "smbs" ("abbr_name", "auth_token", "business_catagory_id", "card_on_file", "city", "country_id", "created_at", "date_of_payment_for_ref", "email", "email_for_card", "full_name", "industry", "logo_content_type", "logo_file_name", "logo_file_size", "logo_updated_at", "partial_code", "password_hash", "password_salt", "per_success", "phone", "st_name_num", "state_id", "state_prov", "stripe_customer_token", "suite_num", "updated_at", "username", "zip_pos") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @smb = Smb.new(params[:smb])
    @smb.partial_code = SecureRandom.base64(5).delete("=").delete("\n\r").tr("+/", "-_")
    @smb.date_of_payment_for_ref = Date.today
    @smb.activation_token = SecureRandom.base64(10).delete("=").delete("\n\r").tr("+/", "-_")
    s = SignupRequest.find_by_beta_key(params[:bk])
    p = PromoCode.find_by_promo_code(params[:pc])
    @smb.business_type = s.package_type
    @smb.credit = p.promo_credit
    @smb.activated = true; #after out of beta, remove TODO
    respond_to do |format|
      if @smb.save(:validate => false)

UPDATE "smbs" SET "card_on_file" = 't', "stripe_customer_token" = 'cus_LOkoFBpLtlOWDM', "updated_at" = '2012-03-01 00:32:31.619830' WHERE "smbs"."id" = 7
---
  def savecard #almost the same as subscription's create
    if current_user
      current_user.attributes = {:email_for_card => params[:smb][:email_for_card], :stripe_card_token => params[:smb][:stripe_card_token]}
      if current_user.save_card("Auth token: "+current_user.auth_token+"; Company Email: "+current_user.email+"; Company Name: "+current_user.full_name)

SELECT "smbs".* FROM "smbs" WHERE "smbs"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "smbs" SET "logo_content_type" = 'image/jpeg', "state_id" = 109, "business_catagory_id" = 15, "password_hash" = '$2a$10$tBjSINb2HJUhv8NfkFmnF.i4bFFK/G4yDIrnBcOL57Y0sq7/h36Vu', "city" = 'sdfasdf', "industry" = 'ewldslkf', "logo_file_size" = 57239, "username" = 'sadfsadf', "updated_at" = '2012-03-01 06:53:18.680267', "full_name" = 'sdfsadf', "state_prov" = '', "zip_pos" = '12312', "logo_updated_at" = '2012-03-01 06:53:10.126159', "date_of_payment_for_ref" = '2012-03-01', "created_at" = '2012-03-01 06:53:18.680267', "st_name_num" = 'dsfklasdf', "abbr_name" = 'sdfsa', "country_id" = 1001, "suite_num" = 0, "email" = 'ddfsdfs@dsfasdfdsfs.ccscsfs', "password_salt" = '$2a$10$tBjSINb2HJUhv8NfkFmnF.', "partial_code" = 'dwmIZDo', "phone" = '1233123123', "logo_file_name" = 'gallery2.jpg' WHERE "smbs"."id" = 8
---
  def set_admin
    begin
      s = Smb.find(params[:userid])
    rescue
      render json:ActiveSupport::JSON.encode({:deleted => true}) and return
    end
    if params[:button_status] == "to_admin"
      s.admin = true
    else
      s.admin = false
    end
    s.save(:validate => false)