app/controllers/subscriptions_controller.rb

SELECT "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
    plan = Plan.find(params[:plan_id])

INSERT INTO "subscriptions" ("created_at", "paypal_customer_token", "paypal_recurring_profile_token", "plan_id", "smb_id", "stripe_customer_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    if current_user
      @subscription = Subscription.new(params[:subscription])
      if @subscription.save_with_payment(current_user, "Auth token: "+current_user.auth_token+"; Company Email: "+current_user.email+"; Company Name: "+current_user.full_name)

SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = ? LIMIT 1  [["id", "4"]]
---
  def show
    @subscription = Subscription.find(params[:id])