app/views/reports/index.html.erb

SELECT "smbs".* FROM "smbs" WHERE "smbs"."id" = ? LIMIT 1  [["id", "7"]]
---

<h1 class="h1-report">Report for <%= Smb.find(params[:smb_id]).full_name %></h1>